src/Documents/Приход/Приход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Приход</name>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗакупки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗакупки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Приход/Forms/ФормаДокумента/Module.bsl
#Область Подсистема_МодульМодели
&НаКлиенте
Функция Модель_ОбработатьДействия(КонтекстИзменений) Экспорт
	Возврат Модель_ОбработатьДействияСервер(КонтекстИзменений);
КонецФункции

&НаСервере
Функция Модель_ОбработатьДействияСервер(КонтекстИзменений)
	Возврат глМодель_ОбработатьДействия(КонтекстИзменений, ЭтаФорма);
КонецФункции
#КонецОбласти

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	глМодель_ПриИзмененииРеквизитаСтроки(ЭтаФорма, глМодель_ТекущиеДанные(Элемент), "Номенклатура");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	глМодель_ПриИзмененииРеквизитаСтроки(ЭтаФорма, глМодель_ТекущиеДанные(Элемент), "Количество");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	глМодель_ПриИзмененииРеквизитаСтроки(ЭтаФорма, глМодель_ТекущиеДанные(Элемент), "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	глМодель_ПриИзмененииРеквизитаСтроки(ЭтаФорма, глМодель_ТекущиеДанные(Элемент), "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока
		И ОтменаРедактирования Тогда
		
		Возврат;
	КонецЕсли;
	
	глМодель_ПриИзмененииРеквизита(ЭтаФорма, "Товары");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	глМодель_ПриИзмененииРеквизита(ЭтаФорма, "Товары");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТовары(Команда)
	ЗаполнитьТоварыСервер()	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыСервер()
	РеквизитыСтроки = Новый Структура;
	РеквизитыСтроки.Вставить("Номенклатура", Справочники.Номенклатура.НайтиПоНаименованию("Номенклатура 1"));
	РеквизитыСтроки.Вставить("Количество", 3);
	
	КонтекстИзменений = глМодель_НачатьИзменения(ЭтаФорма);
	НоваяСтрока = Объект.Товары.Добавить();
	глМодель_ИзменитьРеквизитыСтроки(КонтекстИзменений, НоваяСтрока, РеквизитыСтроки);
	глМодель_ЗавершитьИзменения(КонтекстИзменений);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодбор(Команда)
	ОткрытьФорму("Обработка.ПодборТоваров.Форма", , ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПриЧтенииСозданииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	глМодель_ОбновитьСвойства(ЭтаФорма);
	глМодель_ОбновитьСвойстваСтроки(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	глМодель_ОбновитьСвойстваСтроки(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаЗакупкиПриИзменении(Элемент)
	глМодель_ПриИзмененииРеквизитаСтроки(ЭтаФорма, глМодель_ТекущиеДанные(Элемент), "ЦенаЗакупки");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаЗакупкиПриИзменении(Элемент)
	глМодель_ПриИзмененииРеквизитаСтроки(ЭтаФорма, глМодель_ТекущиеДанные(Элемент), "СуммаЗакупки");
КонецПроцедуры
